nodejs/payment/stripe/tests/invoice.payment_succeeded.json

{
    "account_country": "DE",
    "account_name": "accounts.dummy",
    "account_tax_ids": null,
    "amount_due": 700,
    "amount_paid": 700,
    "amount_remaining": 0,
    "amount_shipping": 0,
    "application": null,
    "application_fee_amount": null,
    "attempt_count": 1,
    "attempted": true,
    "auto_advance": false,
    "automatic_tax": {
        "enabled": true,
        "liability": {
            "type": "self"
        },
        "status": "complete"
    },
    "billing_reason": "subscription_create",
    "charge": "ch_3OfeLCFcdsdSNTPwA1vKXuR03",
    "collection_method": "charge_automatically",
    "created": 1706947965,
    "currency": "eur",
    "custom_fields": null,
    "customer": "cus_PUdccsaz2Um3P3",
    "customer_address": {
        "city": null,
        "country": "DE",
        "line1": null,
        "line2": null,
        "postal_code": null,
        "state": null
    },
    "customer_email": "dummy@test.com",
    "customer_name": "Dummy Test",
    "customer_phone": null,
    "customer_shipping": null,
    "customer_tax_exempt": "none",
    "customer_tax_ids": [],
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "discounts": [],
    "due_date": null,
    "effective_at": 1706947965,
    "ending_balance": 0,
    "footer": null,
    "from_invoice": null,
    "hosted_invoice_url": "https://invoice",
    "id": "in_1OfeLBFcRmSNTPwA904v8Voq",
    "invoice_pdf": "https://invoice/pdf",
    "issuer": {
        "type": "self"
    },
    "last_finalization_error": null,
    "latest_revision": null,
    "lines": {
        "data": [
            {
                "amount": 1400,
                "amount_excluding_tax": 1400,
                "currency": "eur",
                "description": "1 \u00d7 Dummy Product (at \u20ac14.00 / month)",
                "discount_amounts": [],
                "discountable": true,
                "discounts": [],
                "id": "il_1OfeLBFcRmdsaTPwAp8J0S2TJ",
                "livemode": true,
                "metadata": {},
                "object": "line_item",
                "period": {
                    "end": 1709453565,
                    "start": 1706947965
                },
                "plan": {
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 1400,
                    "amount_decimal": "1400",
                    "billing_scheme": "per_unit",
                    "created": 1705583611,
                    "currency": "eur",
                    "id": "price_1OZvPTFcRHKTPwAvpP0VILw",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": true,
                    "metadata": {},
                    "nickname": null,
                    "object": "plan",
                    "product": "prod_POirZlfdsdvI02y",
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1705583611,
                    "currency": "eur",
                    "custom_unit_amount": null,
                    "id": "price_1OZvPTFcRmSNfdfwAvpP0VILw",
                    "livemode": true,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": null,
                    "object": "price",
                    "product": "prod_POirZfdfEWvI02y",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "month",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 1400,
                    "unit_amount_decimal": "1400"
                },
                "proration": false,
                "proration_details": {
                    "credited_items": null
                },
                "quantity": 1,
                "subscription": "sub_1OfeLBFdsmSNTPwAFXcK01ym",
                "subscription_item": "si_PUdcS2VkfdfbTVK",
                "tax_amounts": [
                    {
                        "amount": 0,
                        "inclusive": true,
                        "tax_rate": "txr_1OZvXfFcRmSfdfPwAf3f87fTT",
                        "taxability_reason": "not_collecting",
                        "taxable_amount": 0
                    }
                ],
                "tax_rates": [],
                "type": "subscription",
                "unit_amount_excluding_tax": "1400"
            }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/invoices/in_1OfeLBFcR89kNTPwAO94v8Voq/lines"
    },
    "livemode": true,
    "metadata": {},
    "next_payment_attempt": null,
    "number": "C72F166D-0001",
    "object": "invoice",
    "on_behalf_of": null,
    "paid": true,
    "paid_out_of_band": false,
    "payment_intent": "pi_3OfeLCFcRmeweTPwA1RbxpqtS",
    "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
    },
    "period_end": 1706947965,
    "period_start": 1706947965,
    "post_payment_credit_notes_amount": 0,
    "pre_payment_credit_notes_amount": 0,
    "quote": null,
    "receipt_number": null,
    "rendering": null,
    "rendering_options": null,
    "shipping_cost": null,
    "shipping_details": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "paid",
    "status_transitions": {
        "finalized_at": 1706947965,
        "marked_uncollectible_at": null,
        "paid_at": 1706947990,
        "voided_at": null
    },
    "subscription": "sub_1OfeLBFcRmSNT67AFXcK01ym",
    "subscription_details": {
        "metadata": {}
    },
    "subtotal": 1400,
    "subtotal_excluding_tax": 1400,
    "tax": 0,
    "test_clock": null,
    "total": 1400,
    "total_discount_amounts": [],
    "total_excluding_tax": 1400,
    "total_tax_amounts": [
        {
            "amount": 0,
            "inclusive": true,
            "tax_rate": "txr_1OZvXfFcRmSNTgyAf3f87fTT",
            "taxability_reason": "not_collecting",
            "taxable_amount": 0
        }
    ],
    "transfer_data": null,
    "webhooks_delivered_at": 1706947965
}